const { tag } = require("hexo/dist/plugins/helper/is");

// .versionrc.js
module.exports = {
    types: [
        { type: 'feat', section: '✨ Features | 新功能' },
        { type: 'fix', section: '🐛 Bug Fixes | Bug 修复' },
        { type: 'init', section: '🎉 Init | 初始化' },
        { type: 'docs', section: '✏️ Documentation | 文档' },
        { type: 'style', section: '💄 Styles | 风格' },
        { type: 'refactor', section: '♻️ Code Refactoring | 代码重构' },
        { type: 'perf', section: '⚡ Performance Improvements | 性能优化' },
        { type: 'test', section: '✅ Tests | 测试' },
        { type: 'revert', section: '⏪ Revert | 回退', hidden: true },
        { type: 'build', section: '📦‍ Build System | 打包构建' },
        { type: 'chore', section: '🚀 Chore | 构建/工程依赖/工具' },
        { type: 'ci', section: '👷 Continuous Integration | CI 配置' }
    ],
    // 默认值: "chore(release): {{currentTag}}"
    releaseCommitMessageFormat: `chore(release): {{currentTag}}

██████╗ ███████╗██████╗ ███████╗███████╗██╗███╗   ██╗███████╗   ██╗  ██╗
██╔══██╗██╔════╝██╔══██╗██╔════╝██╔════╝██║████╗  ██║██╔════╝   ╚██╗██╔╝
██████╔╝█████╗  ██║  ██║█████╗  █████╗  ██║██╔██╗ ██║█████╗█████╗╚███╔╝
██╔══██╗██╔══╝  ██║  ██║██╔══╝  ██╔══╝  ██║██║╚██╗██║██╔══╝╚════╝██╔██╗
██║  ██║███████╗██████╔╝███████╗██║     ██║██║ ╚████║███████╗   ██╔╝ ██╗
╚═╝  ╚═╝╚══════╝╚═════╝ ╚══════╝╚═╝     ╚═╝╚═╝  ╚═══╝╚══════╝   ╚═╝  ╚═╝
current version: {{currentTag}} 
    `,
    header: '# Changelog: Hexo Theme Redefine-X',
    // 跳过某步骤 可设置 bump changelog commit tag
    skip: {
        // commit: true
        "changelog": true
    }
}